"""
7. Реализовать проект «Операции с комплексными числами». Создайте класс «Комплексное число»,
реализуйте перегрузку методов сложения и умножения комплексных чисел. Проверьте работу проекта,
создав экземпляры класса (комплексные числа) и выполнив сложение и умножение созданных экземпляров.
Проверьте корректность полученного результата.
"""


class ComplexNumber:

    def __init__(self, number):
        self.number = number

    def __add__(self, other):
        return self.number + other.number

    def __mul__(self, other):
        return self.number * other.number


a = ComplexNumber(1 + 2j)
b = ComplexNumber(3 + 4j)

print(f'{a.number} + {b.number} =', str(a + b)[1:-1])
print(f'{a.number} * {b.number} =', str(a * b)[1:-1])
